<a href="https://colab.research.google.com/github/Zurezh/Python_LearnByDoing/blob/master/Module_5_Data_Frames.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Module 5 - Data Frames

1. Importing data into Python
2. Exploring dataset
3. Renaming columns of data frame
4. Subsetting dataframes
5. Basic Operations with DF
6. Filtering in DF
7. Using .at() and .iat()
8. Intro to Seaborn
9. Visualizing with Seaborn
10. Keywork Arguments in Python
11. Exercise

## Importing Data

In [0]:
import pandas as pd

In [0]:
# Importing from Github as raw data
stats = pd.read_csv('https://raw.githubusercontent.com/Zurezh/Python_LearnByDoing/master/P4-Demographic-Data.csv')

In [0]:
stats

             Country Name Country Code  ...  Internet users         Income Group
0                   Aruba          ABW  ...            78.9          High income
1             Afghanistan          AFG  ...             5.9           Low income
2                  Angola          AGO  ...            19.1  Upper middle income
3                 Albania          ALB  ...            57.2  Upper middle income
4    United Arab Emirates          ARE  ...            88.0          High income
..                    ...          ...  ...             ...                  ...
190           Yemen, Rep.          YEM  ...            20.0  Lower middle income
191          South Africa          ZAF  ...            46.5  Upper middle income
192      Congo, Dem. Rep.          COD  ...             2.2           Low income
193                Zambia          ZMB  ...            15.4  Lower middle income
194              Zimbabwe          ZWE  ...            18.5           Low income

[195 rows x 5 columns]

## Exploring Dataset

In [0]:
# Full Dataset
stats

             Country Name Country Code  ...  Internet users         Income Group
0                   Aruba          ABW  ...            78.9          High income
1             Afghanistan          AFG  ...             5.9           Low income
2                  Angola          AGO  ...            19.1  Upper middle income
3                 Albania          ALB  ...            57.2  Upper middle income
4    United Arab Emirates          ARE  ...            88.0          High income
..                    ...          ...  ...             ...                  ...
190           Yemen, Rep.          YEM  ...            20.0  Lower middle income
191          South Africa          ZAF  ...            46.5  Upper middle income
192      Congo, Dem. Rep.          COD  ...             2.2           Low income
193                Zambia          ZMB  ...            15.4  Lower middle income
194              Zimbabwe          ZWE  ...            18.5           Low income

[195 rows x 5 columns]

In [0]:
# Number of rows
len(stats) #195 rows imported

195

In [0]:
# See Columns
stats.columns

Index(['Country Name', 'Country Code', 'Birth rate', 'Internet users',
       'Income Group'],
      dtype='object')

In [0]:
# No.of Columns
len(stats.columns) # 5 columns

5

In [0]:
# Top rows
stats.head() #Remember the brackets

           Country Name Country Code  ...  Internet users         Income Group
0                 Aruba          ABW  ...            78.9          High income
1           Afghanistan          AFG  ...             5.9           Low income
2                Angola          AGO  ...            19.1  Upper middle income
3               Albania          ALB  ...            57.2  Upper middle income
4  United Arab Emirates          ARE  ...            88.0          High income

[5 rows x 5 columns]

In [0]:
# Top 10 rows
stats.head(10) #Remember the brackets

           Country Name Country Code  ...  Internet users         Income Group
0                 Aruba          ABW  ...         78.9000          High income
1           Afghanistan          AFG  ...          5.9000           Low income
2                Angola          AGO  ...         19.1000  Upper middle income
3               Albania          ALB  ...         57.2000  Upper middle income
4  United Arab Emirates          ARE  ...         88.0000          High income
5             Argentina          ARG  ...         59.9000          High income
6               Armenia          ARM  ...         41.9000  Lower middle income
7   Antigua and Barbuda          ATG  ...         63.4000          High income
8             Australia          AUS  ...         83.0000          High income
9               Austria          AUT  ...         80.6188          High income

[10 rows x 5 columns]

In [0]:
# Bottom Rows
stats.tail()

         Country Name Country Code  ...  Internet users         Income Group
190       Yemen, Rep.          YEM  ...            20.0  Lower middle income
191      South Africa          ZAF  ...            46.5  Upper middle income
192  Congo, Dem. Rep.          COD  ...             2.2           Low income
193            Zambia          ZMB  ...            15.4  Lower middle income
194          Zimbabwe          ZWE  ...            18.5           Low income

[5 rows x 5 columns]

In [0]:
# Bottom 8 Rows
stats.tail(8)

           Country Name Country Code  ...  Internet users         Income Group
187             Vanuatu          VUT  ...            11.3  Lower middle income
188  West Bank and Gaza          PSE  ...            46.6  Lower middle income
189               Samoa          WSM  ...            15.3  Lower middle income
190         Yemen, Rep.          YEM  ...            20.0  Lower middle income
191        South Africa          ZAF  ...            46.5  Upper middle income
192    Congo, Dem. Rep.          COD  ...             2.2           Low income
193              Zambia          ZMB  ...            15.4  Lower middle income
194            Zimbabwe          ZWE  ...            18.5           Low income

[8 rows x 5 columns]

In [0]:
# Information on the columns
stats.info() #similar to str function in R

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 195 entries, 0 to 194
Data columns (total 5 columns):
Country Name      195 non-null object
Country Code      195 non-null object
Birth rate        195 non-null float64
Internet users    195 non-null float64
Income Group      195 non-null object
dtypes: float64(2), object(3)
memory usage: 7.7+ KB

In [0]:
# Get stats on the columns
stats.describe() #similar to summary() in R

       Birth rate  Internet users
count  195.000000      195.000000
mean    21.469928       42.076471
std     10.605467       29.030788
min      7.900000        0.900000
25%     12.120500       14.520000
50%     19.680000       41.000000
75%     29.759500       66.225000
max     49.661000       96.546800

In [0]:
stats.describe().transpose()

                count       mean        std  ...    50%      75%      max
Birth rate      195.0  21.469928  10.605467  ...  19.68  29.7595  49.6610
Internet users  195.0  42.076471  29.030788  ...  41.00  66.2250  96.5468

[2 rows x 8 columns]

## Renaming the column

In [0]:
stats.head()

           Country Name Country Code  ...  Internet users         Income Group
0                 Aruba          ABW  ...            78.9          High income
1           Afghanistan          AFG  ...             5.9           Low income
2                Angola          AGO  ...            19.1  Upper middle income
3               Albania          ALB  ...            57.2  Upper middle income
4  United Arab Emirates          ARE  ...            88.0          High income

[5 rows x 5 columns]

In [0]:
stats.columns

Index(['Country Name', 'Country Code', 'Birth rate', 'Internet users',
       'Income Group'],
      dtype='object')

In [0]:
stats.columns = ['a','b','c','d','e']

In [0]:
stats.head()

                      a    b       c     d                    e
0                 Aruba  ABW  10.244  78.9          High income
1           Afghanistan  AFG  35.253   5.9           Low income
2                Angola  AGO  45.985  19.1  Upper middle income
3               Albania  ALB  12.877  57.2  Upper middle income
4  United Arab Emirates  ARE  11.044  88.0          High income

In [0]:
stats.columns = ['CountryName', 'CountryCode', 'BirthRate', 'InternetUsers',
       'IncomeGroup']

In [0]:
stats.head()

            CountryName CountryCode  ...  InternetUsers          IncomeGroup
0                 Aruba         ABW  ...           78.9          High income
1           Afghanistan         AFG  ...            5.9           Low income
2                Angola         AGO  ...           19.1  Upper middle income
3               Albania         ALB  ...           57.2  Upper middle income
4  United Arab Emirates         ARE  ...           88.0          High income

[5 rows x 5 columns]

## Subsetting Dataframes

In [0]:
stats.head()

            CountryName CountryCode  ...  InternetUsers          IncomeGroup
0                 Aruba         ABW  ...           78.9          High income
1           Afghanistan         AFG  ...            5.9           Low income
2                Angola         AGO  ...           19.1  Upper middle income
3               Albania         ALB  ...           57.2  Upper middle income
4  United Arab Emirates         ARE  ...           88.0          High income

[5 rows x 5 columns]

In [0]:
# Three Parts
# Subset by Rows
# Subset by Columns
# Subset by both

In [0]:
# Part 1: Rows
stats[21:26]

   CountryName CountryCode  BirthRate  InternetUsers          IncomeGroup
21      Belize         BLZ     23.092          33.60  Upper middle income
22     Bermuda         BMU     10.400          95.30          High income
23     Bolivia         BOL     24.236          36.94  Lower middle income
24      Brazil         BRA     14.931          51.04  Upper middle income
25    Barbados         BRB     12.188          73.00          High income

In [0]:
stats[185:]

               CountryName CountryCode  ...  InternetUsers          IncomeGroup
185  Virgin Islands (U.S.)         VIR  ...           45.3          High income
186                Vietnam         VNM  ...           43.9  Lower middle income
187                Vanuatu         VUT  ...           11.3  Lower middle income
188     West Bank and Gaza         PSE  ...           46.6  Lower middle income
189                  Samoa         WSM  ...           15.3  Lower middle income
190            Yemen, Rep.         YEM  ...           20.0  Lower middle income
191           South Africa         ZAF  ...           46.5  Upper middle income
192       Congo, Dem. Rep.         COD  ...            2.2           Low income
193                 Zambia         ZMB  ...           15.4  Lower middle income
194               Zimbabwe         ZWE  ...           18.5           Low income

[10 rows x 5 columns]

In [0]:
stats[:5]

            CountryName CountryCode  ...  InternetUsers          IncomeGroup
0                 Aruba         ABW  ...           78.9          High income
1           Afghanistan         AFG  ...            5.9           Low income
2                Angola         AGO  ...           19.1  Upper middle income
3               Albania         ALB  ...           57.2  Upper middle income
4  United Arab Emirates         ARE  ...           88.0          High income

[5 rows x 5 columns]

In [0]:
# Reverse the dataframe
stats[::-1]

              CountryName CountryCode  ...  InternetUsers          IncomeGroup
194              Zimbabwe         ZWE  ...           18.5           Low income
193                Zambia         ZMB  ...           15.4  Lower middle income
192      Congo, Dem. Rep.         COD  ...            2.2           Low income
191          South Africa         ZAF  ...           46.5  Upper middle income
190           Yemen, Rep.         YEM  ...           20.0  Lower middle income
..                    ...         ...  ...            ...                  ...
4    United Arab Emirates         ARE  ...           88.0          High income
3                 Albania         ALB  ...           57.2  Upper middle income
2                  Angola         AGO  ...           19.1  Upper middle income
1             Afghanistan         AFG  ...            5.9           Low income
0                   Aruba         ABW  ...           78.9          High income

[195 rows x 5 columns]

In [0]:
# Get only 20th row
stats[::20]

    CountryName CountryCode  BirthRate  InternetUsers          IncomeGroup
0         Aruba         ABW     10.244        78.9000          High income
20      Belarus         BLR     12.500        54.1700  Upper middle income
40   Costa Rica         CRI     15.022        45.9600  Upper middle income
60        Gabon         GAB     30.555         9.2000  Upper middle income
80        India         IND     20.291        15.1000  Lower middle income
100       Libya         LBY     21.425        16.5000  Upper middle income
120  Mozambique         MOZ     39.705         5.4000           Low income
140      Poland         POL      9.600        62.8492          High income
160    Suriname         SUR     18.455        37.4000  Upper middle income
180     Uruguay         URY     14.374        57.6900          High income

In [0]:
# Part 2: Columns

In [0]:
stats.head()

            CountryName CountryCode  ...  InternetUsers          IncomeGroup
0                 Aruba         ABW  ...           78.9          High income
1           Afghanistan         AFG  ...            5.9           Low income
2                Angola         AGO  ...           19.1  Upper middle income
3               Albania         ALB  ...           57.2  Upper middle income
4  United Arab Emirates         ARE  ...           88.0          High income

[5 rows x 5 columns]

In [0]:
stats.columns

Index(['CountryName', 'CountryCode', 'BirthRate', 'InternetUsers',
       'IncomeGroup'],
      dtype='object')

In [0]:
stats['CountryName']

0                     Aruba
1               Afghanistan
2                    Angola
3                   Albania
4      United Arab Emirates
               ...
190             Yemen, Rep.
191            South Africa
192        Congo, Dem. Rep.
193                  Zambia
194                Zimbabwe
Name: CountryName, Length: 195, dtype: object

In [0]:
stats['CountryName'].head()

0                   Aruba
1             Afghanistan
2                  Angola
3                 Albania
4    United Arab Emirates
Name: CountryName, dtype: object

In [0]:
stats[['CountryName','BirthRate']].head() # Note the columns are provided as list

            CountryName  BirthRate
0                 Aruba     10.244
1           Afghanistan     35.253
2                Angola     45.985
3               Albania     12.877
4  United Arab Emirates     11.044

In [0]:
stats['BirthRate']

0      10.244
1      35.253
2      45.985
3      12.877
4      11.044
        ...
190    32.947
191    20.850
192    42.394
193    40.471
194    35.715
Name: BirthRate, Length: 195, dtype: float64

In [0]:
stats.BirthRate.head()

0    10.244
1    35.253
2    45.985
3    12.877
4    11.044
Name: BirthRate, dtype: float64

In [0]:
# Part 3. Combine the Rows and Columns
stats[4:8][['CountryName','BirthRate']]

            CountryName  BirthRate
4  United Arab Emirates     11.044
5             Argentina     17.716
6               Armenia     13.308
7   Antigua and Barbuda     16.447

In [0]:
stats[['CountryName','BirthRate']][4:8]

            CountryName  BirthRate
4  United Arab Emirates     11.044
5             Argentina     17.716
6               Armenia     13.308
7   Antigua and Barbuda     16.447

## Basic Operations in DF

In [46]:
stats.head()

            CountryName CountryCode  ...  InternetUsers          IncomeGroup
0                 Aruba         ABW  ...           78.9          High income
1           Afghanistan         AFG  ...            5.9           Low income
2                Angola         AGO  ...           19.1  Upper middle income
3               Albania         ALB  ...           57.2  Upper middle income
4  United Arab Emirates         ARE  ...           88.0          High income

[5 rows x 5 columns]

In [0]:
#Mathematical Operations
result = stats.BirthRate * stats.InternetUsers # No meaning of this result, using it just for calculation

In [50]:
result.head()

0    808.2516
1    207.9927
2    878.3135
3    736.5644
4    971.8720
dtype: float64

In [0]:
# Add Column in DF
stats['MyCalc'] = stats.BirthRate * stats.InternetUsers

In [52]:
stats.head()

            CountryName CountryCode  ...          IncomeGroup    MyCalc
0                 Aruba         ABW  ...          High income  808.2516
1           Afghanistan         AFG  ...           Low income  207.9927
2                Angola         AGO  ...  Upper middle income  878.3135
3               Albania         ALB  ...  Upper middle income  736.5644
4  United Arab Emirates         ARE  ...          High income  971.8720

[5 rows x 6 columns]

In [0]:
# Removing the Column
stats = stats.drop('MyCalc',axis=1)

In [57]:
stats.head()

            CountryName CountryCode  ...  InternetUsers          IncomeGroup
0                 Aruba         ABW  ...           78.9          High income
1           Afghanistan         AFG  ...            5.9           Low income
2                Angola         AGO  ...           19.1  Upper middle income
3               Albania         ALB  ...           57.2  Upper middle income
4  United Arab Emirates         ARE  ...           88.0          High income

[5 rows x 5 columns]

## Filtering DataFrames